Revit 2024 API
LinkedResourceOpeningEventArgs Class
 The event arguments used by [!:Autodesk::Revit::ApplicationServices::Application::LinkedResourceOpening].
Namespace: Autodesk.Revit.DB.Events
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2018
Syntax
C#
public class LinkedResourceOpeningEventArgs : RevitAPIPreEventArgs
Visual Basic
Public Class LinkedResourceOpeningEventArgs _
	Inherits RevitAPIPreEventArgs
Visual C++
public ref class LinkedResourceOpeningEventArgs : public RevitAPIPreEventArgs
Inheritance Hierarchy
System.Object
 System.EventArgs
 Autodesk.Revit.DB.Events.RevitAPIEventArgs
 Autodesk.Revit.DB.Events.RevitAPIPreEventArgs
 Autodesk.Revit.DB.Events.LinkedResourceOpeningEventArgs
See Also
LinkedResourceOpeningEventArgs Members
Autodesk.Revit.DB.Events Namespace